<a href="https://colab.research.google.com/github/dylanahola/Car_Insurance_Rates_by_State/blob/main/DataVisualization.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
from google.colab import drive 
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [8]:
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np

In [9]:
filename = '/content/drive/MyDrive/Coding Dojo/Week 3/Cost_of_car_insurance_by_state (1).xlsx'
insurance_df = pd.read_excel(filename)
insurance_df.head()

  Cost of auto insurance in each state    Unnamed: 1  ...  Unnamed: 4 Unnamed: 5
0                                 Rank         State  ...  Difference        NaN
1                                    1      Michigan  ...        3441        NaN
2                                    2  Rhode Island  ...        2258        NaN
3                                    3     Louisiana  ...        2196        NaN
4                                    4      Kentucky  ...        2079        NaN

[5 rows x 6 columns]

In [10]:
insurance_df.drop(columns = 'Unnamed: 5', inplace = True)
insurance_df.drop(columns = 'Cost of auto insurance in each state', inplace = True)

In [11]:
insurance_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 1  52 non-null     object
 1   Unnamed: 2  52 non-null     object
 2   Unnamed: 3  52 non-null     object
 3   Unnamed: 4  52 non-null     object
dtypes: object(4)
memory usage: 1.8+ KB

In [12]:
insurance_df.head()

     Unnamed: 1     Unnamed: 2        Unnamed: 3  Unnamed: 4
0         State  Full coverage  Minimum coverage  Difference
1      Michigan           8723              5282        3441
2  Rhode Island           3847              1589        2258
3     Louisiana           3525              1329        2196
4      Kentucky           3418              1338        2079

In [13]:
insurance_df.dropna(inplace=True)

In [14]:
#I needed a refresher on dropping rows from a dataset so I referenced this site for help. (https://chrisalbon.com/python/data_wrangling/pandas_dropping_column_and_rows/)
insurance_df.drop(insurance_df.index[0], inplace = True)

In [15]:
insurance_df = insurance_df.rename(columns = {'Unnamed: 1': 'State', 'Unnamed: 2': 'Full Coverage','Unnamed: 3': 'Minimum Coverage','Unnamed: 4':'Difference'})

In [ ]:
insurance_df

In [17]:
state = insurance_df['State']
mincoverage = insurance_df['Minimum Coverage']
fullcoverage = insurance_df['Full Coverage']
difference = insurance_df['Difference']

In [ ]:
insurance_df['Full Coverage']
filtered_df = insurance_df['State']
filtered_df

In [19]:
top20costs = fullcoverage.values[31:51]

In [ ]:
top20state = state.values[31:51]
top20state

In [ ]:
plt.bar(top20state, top20costs);
plt.style.available
plt.style.use('seaborn');
plt.xticks(rotation = 90);
plt.xlabel('States', fontsize = 16);
plt.ylabel('Cost of Full Coverage in Dollars', fontsize = 16);
plt.title('20 States with the Most Affordable Full Coverage Insurance', fontsize = 16);
plt.ylim(bottom= 1000, top = 2100)